tutorials/reactingQGDFoam/1D/Abgrall/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       reactingQGDFoam;

startFrom         latestTime;

startTime         0;

stopAt            endTime;

endTime           2e-4;

deltaT            1e-8;

writeControl      adjustableRunTime;

writeInterval     1e-5;

purgeWrite        0;

writeFormat       ascii;

writePrecision    8;

writeCompression  off;

timeFormat        general;

timePrecision     6;

graphFormat       raw;

runTimeModifiable true;

adjustTimeStep    true;

maxCo             0.25;

CourantType       cellCourant;

// ************************************************************************* //
